      * Copy Book ADDRZIP - Record Definition for
      * File DDS0001.LEARN.STATE.ADDRESS.ZIP
      *
      * COPY ADDRZIP.

          05 STATE-NAME PIC X(16).
          05 STATE-CODE PIC X(2).
          05 FILLER     PIC X(2).
          05 ZIPCODE-RANGE-LO PIC X(8).
          05 ZIPCODE-RANGE-HI PIC X(8).
          05 FILLER PIC X(84).